Repository: PopkovPavel/GraphPAD
Catalog: GraphPAD/Properties/Language.*.resx
Languages: ru_ru

# AccountIDString
source: Account ID
ru_ru: ID Аккаунта

# AlgorithmsBtn
source: Algorithms
ru_ru: Алгоритмы

# AnimationSpeedBtn
source: Animation speed
ru_ru: Скорость анимации

# AnimationSpeedBtnTooltip
source: Current animation speed -
ru_ru: Текущая скорость анимации -

source: Application settings
ru_ru: Настройки приложения

# AudioOffTooltip
source: Turn OFF sound
ru_ru: Выключить звук

# AudioOnTooltip
source: Turn ON sound
ru_ru: Включить звук

# AuthBtn
source: Authorize
ru_ru: Авторизация

# AuthPageTitile
source: GraphPAD (Authorization)
ru_ru: GraphPAD (Авторизация)

source: Browser Version
ru_ru: Браузерная версия

# BrushBtn
source: Brush
ru_ru: Кисть

# BrushSizeSlider
source: Brush size:
ru_ru: Размер Кисти:

# CameraBtn
source: Camera
ru_ru: Камера

# CancelBtn
source: Cancel
ru_ru: Отмена

# Caption
source: Message
ru_ru: Сообщение

# ChangeLangBtn
source: Change
ru_ru: Изменить

# ChangeLanguageBtnTooltip
source: Apply selected language
ru_ru: Применить выбранный язык

# ChangePasswordBtn
source: Change Password
ru_ru: Изменить Пароль

# ChooseAlgorithmComboBox
source: Select Algorithm
ru_ru: Выберите алгоритм

source: Choose new Avatar
ru_ru: Выберите новый Аватар

# ColorPickerString
source: Color Picker
ru_ru: Палитра цветов

# ConferenceChatString
source: Chat conference
ru_ru: Чат конференции

# ConferenceParticipantsString
source: Conference Participants
ru_ru: Участники конференции

# ConferencesCount
source: Conferences:
ru_ru: Конференций:

# ConferencesUpdateBtnTooltip
source: Refresh conferences list
ru_ru: Обновить список конференций

# ConferenceVideoChatString
source: Conference Video chat
ru_ru: Видео-чат конференции

# ConferenssionIdString
source: Conference ID...
ru_ru: ID Конференции...

# ConferenssionNameString
source: Conference Name...
ru_ru: Название конференции...

source: Confirmation
ru_ru: Подтверждение

# ConfirmationMessage
source: Create new Conference? Conference Name:
ru_ru: Создать новую конференцию? Название конференции:

# CopyIDBtn
source: Copy ID
ru_ru: Скопировать ID

# CopyIDMessage
source: ID copied to clipboard.
ru_ru: ID скопирован в буфер обмена.

source: Create
ru_ru: Создать

# CreateAccBtn
source: Register now
ru_ru: Зарегистрироваться

# CreateAccWithThisDataMessage
source: Create an account with this data? Name -
ru_ru: Создать аккаунт с этими данными? Имя -

# CreateConferenssionMessage
source: You have successfully created a conference. Conference Name:
ru_ru: Вы успешно создали конференцию. Название:

# CreateGraphBtn
source: Adding
ru_ru: Добавление

# CreateLobbyBtn
source: Create conference
ru_ru: Создать конференцию

# CurrentLanguage
source: Current language: English
ru_ru: Текущий язык: Русский

source: Current Mode: Algorithms
ru_ru: Текущий режим: Алгоритмы

# CurrentModeAlgorithmsOffTooltip
source: Disable Algorithms Mode
ru_ru: Выключить режим Алгоритмов

# CurrentModeAlgorithmsOnTooltip
source: Enable Algorithms Mode
ru_ru: Включить режим Алгоритмов

source: Current Mode: Brush
ru_ru: Текущий режим: Кисть

# CurrentModeBrushOffTooltip
source: Disable Brush Mode
ru_ru: Выключить Кисть

# CurrentModeBrushOnTooltip
source: Enable Brush Mode
ru_ru: Включить Кисть

# CurrentModeCreate
source: Current Mode: Creation
ru_ru: Текущий режим: Создание

# CurrentModeCreateOffTooltip
source: Disable Build Mode
ru_ru: Выключить режим Создания

# CurrentModeCreateOnTooltip
source: Enable Build Mode
ru_ru: Включить режим Создания

source: Current Mode: Cursor
ru_ru: Текущий режим: Курсор

source: Current Mode: Delete
ru_ru: Текущий режим: Удаление

# CurrentModeDeleteOffTooltip
source: Disable Delete Mode
ru_ru: Выключить режим Удаления

# CurrentModeDeleteOnTooltip
source: Enable Delete Mode
ru_ru: Включить режим Удаления

source: Current Mode: Eraser
ru_ru: Текущий режим: Ластик

# CurrentModeEraserOffTooltip
source: Disable Eraser Mode
ru_ru: Выключить Ластик

# CurrentModeEraserOnTooltip
source: Enable Eraser Mode
ru_ru: Включить Ластик

# CurrentModeEraserSmart
source: Current Mode: Smart Eraser
ru_ru: Текущий режим: Умный Ластик

# CurrentModeEraserSmartOffTooltip
source: Disable Smart Eraser Mode
ru_ru: Выключить Умный Ластик

# CurrentModeEraserSmartOnTooltip
source: Enable Smart Eraser Mode
ru_ru: Включить Умный Ластик

# CurrentModeGraphGen
source: Current Mode: Graph Generation
ru_ru: Текущий режим: Генерация графов

# CurrentModeGraphGenOffTooltip
source: Disable Graph Generation Mode
ru_ru: Выключить режим Генерации Графов

# CurrentModeGraphGenOnTooltip
source: Enable Graph Generation Mode
ru_ru: Включить режим Генерации Графов

# CurrentModeMove
source: Current Mode: Moving
ru_ru: Текущий режим: Перемещение

# CurrentModeRandConnGraph
source: Current Mode: Random Connected Graph
ru_ru: Текущий режим: Случайный связный граф

# CurrentModeRandConnGraphOffTooltip
source: Disable Random Connected Graph Generation Mode
ru_ru: Выключить режим Генерации Случайного Связного Графа

# CurrentModeRandConnGraphOnTooltip
source: Enable Random Connected Graph Generation Mode
ru_ru: Включить режим Генерации Случайного Связного Графа

# CurrentModeRandTree
source: Current Mode: Random Tree
ru_ru: Текущий режим: Случайное дерево

# CurrentModeRandTreeOffTooltip
source: Disable Random Tree Generation Mode
ru_ru: Выключить режим Генерации Случайного Дерева

# CurrentModeRandTreeOnTooltip
source: Enable Random Tree Generation Mode
ru_ru: Включить режим Генерации Случайного Дерева

source: Current Mode: Selection
ru_ru: Текущий режим: Выделение

# CurrentModeSelectionOffTooltip
source: Disable Selection Mode
ru_ru: Выключить режим Выделения

# CurrentModeSelectionOnTooltip
source: Enable Selection Mode
ru_ru: Включить режим Выделения

# DeleteConferenssionBtn
source: Delete Conference
ru_ru: Удалить Конференцию

# DeleteGraphBtn
source: Deleting
ru_ru: Удаление

# EdgesAmountBtn
source: Edges amount
ru_ru: Кол-во рёбер

# EdgesCountErrorMessage
source: The number of edges should not be less than N-1, the number of edges should not be more than N (N-1) / 2.
ru_ru: Количество ребер не должно быть меньше N-1, количество ребер не должно быть больше N(N-1)/2.

# EdgesCountMessage
source: Enter the number of vertices.
ru_ru: Введено некорректное количество вершин.

# EdgesWeightBtn
source: Edge Weight
ru_ru: Вес ребра

# EmailString
source: Email
ru_ru: Эл. почта

source: English
ru_ru: Английский

source: Enter
ru_ru: Войти

# EnterConferenssionErrorMessage
source: This conference does not exist, or it has already been added.
ru_ru: Такой конференции не существует, либо она уже была добавлена.

# EnterConferenssionIDTooltip
source: Enter Conference ID
ru_ru: Введите ID конференции

# EnterConferenssionMessage1
source: You have successfully entered the conference. ID:
ru_ru: Вы успешно вошли в конференцию. Её ID:

# EnterConferenssionMessage2
source: To join a conference, select it in the list on the left side of the app.
ru_ru: Чтобы подключиться к конференции выберите её в списке слева.

# EnterConferenssionNameTooltip
source: Enter Conference Name
ru_ru: Введите название конференции

# EnterEmailString
source: Enter E-mail
ru_ru: Введите эл. почту

# EnterLobbyBtn
source: Enter conference
ru_ru: Войти в конференцию

# EnterMessageField
source: Write a message ...
ru_ru: Напишите сообщение ...

# EnterNameString
source: Enter name
ru_ru: Введите отображаемое имя

# EnterNewPasswordString
source: Enter new password
ru_ru: Введите новый пароль

# EnterPasswordString1
source: Enter password
ru_ru: Введите пароль

# EnterPasswordString2
source: Enter password again
ru_ru: Введите пароль ещё раз

# EraserBtn
source: Eraser
ru_ru: Ластик

# EraserSizeSlider
source: Eraser size:
ru_ru: Размер Ластика:

source: Error
ru_ru: Ошибка

# ExistingEmail
source: A user with this E-Mail already exists.
ru_ru: Пользователь с таким E-Mail-ом уже существует.

# ExitAccountBtn
source: Sign Out
ru_ru: Выйти из Аккаунта

# ExitAppMessage
source: Are you sure you want to quit?
ru_ru: Вы действительно хотите выйти?

# GenGraphBtn
source: Create Graph
ru_ru: Создать граф

# GraphFileNotSelected
source: No file selected to load the graph.
ru_ru: Не выбран файл для загрузки графа.

# GraphGenBtn
source: Graphs Generation
ru_ru: Генерация графов

# GraphModeChangerBtn
source: Graph Mode
ru_ru: Графы

# GraphModeChangerBtnTooltip
source: Switch to Draw Mode
ru_ru: Переключить на режим Рисования

# GuestAccsNotWork
source: Guest accounts are not supported yet.
ru_ru: Гостевые аккаунты пока не поддерживаются.

# GuestModeBtn
source: Continue without login
ru_ru: Продолжить без входа

# GuestString
source: Guest
ru_ru: Гость

# HasAccountString
source: Already have an Account?
ru_ru: Уже есть Аккаунт?

# HasConferenceString
source: Conference
ru_ru: Конференция

# IncorrectEmailDataTooltip
source: Entered incorrect data. (The "@" symbol or the "." symbol may be missing)
ru_ru: Введены некорректные данные. (Возможно отсутствует символ "@" или символ ".")

# InfoString
source: To work with graphs, as well as communicate with users, you must first enter the conference or create your own.
ru_ru: Для работы с графами, а также общения с пользователями необходимо сначала войти в конференцию или же создать собственную.

# InterfaceBtn
source: Interface
ru_ru: Интерфейс

# InterfaceText
source: Interface settings
ru_ru: Настройки интерфейса

# LanguageHint
source: Choose language
ru_ru: Выберите язык

# LeaveConferenssionBtn
source: Leave Conference
ru_ru: Покинуть Конференцию

# LeaveString
source: Leave
ru_ru: Покинуть

source: Links:
ru_ru: Ссылки:

# LoginString
source: Enter login
ru_ru: Введите логин

# LoginSucess
source: Successful login
ru_ru: Успешный вход

# LogoText
source: Application for working with graphs online
ru_ru: Приложение для работы с графами онлайн

# MessageBoxLanguageText
source: The changes will take effect after the application is restarted.
ru_ru: Изменения вступят в силу после перезапуска приложения.

# MyAccountBtn
source: My account
ru_ru: Мой Аккаунт

# NoAccount
source: Don't have an Account?
ru_ru: Нет Аккаунта?

# NoConferenceString
source: Conference ...
ru_ru: Конференция ...

# OrientationBtn
source: Oriented?
ru_ru: Ориентированный?

# OwnerString
source: Owner:
ru_ru: Владелец:

# PaintModeChangerBtn
source: Draw Mode
ru_ru: Рисование

# PaintModeChangerBtnTooltip
source: Switch to Graph Mode
ru_ru: Переключить на режим Графов

# ParticipantsBtn
source: Participants
ru_ru: Участники

# ParticipantsString
source: Participants:
ru_ru: Участники:

# PasswordAndAuth
source: Password and Authentication
ru_ru: Пароль и аутентификация

# PasswordsDontMatchTooltip
source: Passwords do not match.
ru_ru: Пароли не совпадают.

# PasswordString
source: Enter password
ru_ru: Введите пароль

source: Profile settings
ru_ru: Настройки пользователя

# RandConnGraphBtn
source: Rand. Conn. Graph
ru_ru: Случ. связный граф

# RandTreeBtn
source: Random Tree
ru_ru: Случайное дерево

# RegPageTitile
source: GraphPAD (Registration)
ru_ru: GraphPAD (Регистрация)

# RememberMeCheckBox
source: Remember me on this computer
ru_ru: Запомнить меня на этом компьютере

# ReorderBtn
source: Reorder Graph
ru_ru: Упорядочить граф

source: Russian
ru_ru: Русский

# SaveGraphToFileBtnTooltip
source: Save graph to file
ru_ru: Сохранить граф в файл

# SaveImageString
source: Save image
ru_ru: Сохранить изображение

# SaveToFileBtn
source: Save to File
ru_ru: Сохранить в файл

# SelectionBtn
source: Selection
ru_ru: Выделение

# SendMessageYou
source: You:
ru_ru: Вы:

# SettingsTitle
source: Settings
ru_ru: Настройки

# SettingsTooltip
source: Settings
ru_ru: Настройки

# ShowAlgorithm
source: Run
ru_ru: Запустить

# ShowAlgorithmTooltip
source: Run selected Algorithm
ru_ru: Запустить выбранный алгоритм

source: Sign Up
ru_ru: Войти

# SmartEraserBtn
source: Smart Eraser
ru_ru: Умный Ластик

source: Something went wrong.
ru_ru: Что-то пошло не так.

# SuccessPasswordChange
source: Password changed successfully.
ru_ru: Пароль успешно изменён.

# SuccessReg
source: Registration completed successfully.
ru_ru: Регистрация прошла успешно.

# SymbolCountString
source: Symbols
ru_ru: Символов

# TextChatBtn
source: Text Chat
ru_ru: Текстовый чат

# TooShortLoginTooltip
source: Login is too short. Minimum login length - 5 characters.
ru_ru: Логин слишком короткий. Минимальная длина логина - 5 символов

# TooShortNameTooltip
source: Name too short. The minimum name length - 3 characters.
ru_ru: Имя слишком короткое. Минимальная длина имени - 3 символа.

# TooShortPassword
source: Password is too short. Minimum password length - 8 characters.
ru_ru: Пароль слишком короткий. Минимальная длина пароля - 8 символов.

# TooShortPasswordTooltip
source: Too short password. Minimum password length - 8 characters.
ru_ru: Пароль слишком короткий. Минимальная длина пароля - 8 символов.

# UploadGraphBtn
source: Upload Graph
ru_ru: Загрузить граф

# UserString
source: User
ru_ru: Пользователь

# VertexAmountBtn
source: Vertex amount
ru_ru: Кол-во вершин

# VideoChatBtn
source: Video Chat
ru_ru: Видео-чат

# VideoOffString
source: Camera OFF
ru_ru: Видео отключено

# VideoOffTooltip
source: Turn OFF camera
ru_ru: Выключить веб-камеру

# VideoOnString
source: Camera ON
ru_ru: Видео подключено

# VideoOnTooltip
source: Turn ON camera
ru_ru: Включить веб-камеру

# Vk
source: Our VK Group
ru_ru: Наш ВК

# VoiceAndSoundBtn
source: Voice and Sound
ru_ru: Голос и звук

# VoiceChatOffString
source: Voice chat OFF
ru_ru: Голосовой чат выключен

# VoiceChatOffTooltip
source: Turn OFF microphone
ru_ru: Выключить микрофон

# VoiceChatOnString
source: Voice chat ON
ru_ru: Голосовой чат подключен

# VoiceChatOnTooltip
source: Turn ON microphone
ru_ru: Включить микрофон

# WelcomeString
source: Welcome,
ru_ru: Здравствуйте,

# WrongLogOrPassTooltip
source: Wrong login or password.
ru_ru: Неверный логин или пароль.

# YouCannotDeleteThisRoom
source: You cannot delete someone else's conference.
ru_ru: Вы не можете удалить чужую конференцию.

# YouCannotLeaveThisRoom
source: You cannot leave your own conference.
ru_ru: Вы не можете покинуть собственную конференцию.

# YouDeletedRoom
source: You have deleted conference
ru_ru: Вы удалили конференцию

# YouLeavedRoom
source: You left conference
ru_ru: Вы покинули конференцию

# YT
source: Our Youtube Channel
ru_ru: Наш Youtube
